app/controllers/school_classes_controller.rb

  def update
    set_school_class
    @school_class.update(school_class_params)
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["id", 1]]