app/controllers/students_controller.rb

  def update
    set_student
    @student.update(student_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-11-07 19:21:19.983989"], ["id", 1]]